УчетВУправляющихДляГит1/src/InformationRegisters/СостоянияИнтеграцииСПлатформойСамозанятые/СостоянияИнтеграцииСПлатформойСамозанятые.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияИнтеграцииСПлатформойСамозанятые</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияИнтеграцииСПлатформойСамозанятые</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПриложения</name>
    <comment>Идентификатор приложения в сервисе Чеки самозанятых</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Enums/СостоянияИнтеграцииСПлатформойСамозанятые/СостоянияИнтеграцииСПлатформойСамозанятые.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияИнтеграцииСПлатформойСамозанятые</name>
  <enumValues>
    <name>Отсутствует</name>
  </enumValues>
  <enumValues>
    <name>НеПривязано</name>
  </enumValues>
  <enumValues>
    <name>НеНастроено</name>
  </enumValues>
  <enumValues>
    <name>Подключено</name>
  </enumValues>
  <enumValues>
    <name>Отключено</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/InformationRegisters/СостоянияИнтеграцииСПлатформойСамозанятые/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает состояние подключения с платформой Самозанятые.
// Параметры:
//   Организация - СправочникСсылка.Организации.
//   Ответ       - Структура, разобранный ответ платформы, см. ИнтеграцияСПлатформойСамозанятые.НовыйРезультатЗапроса.
//
Процедура ЗаписатьСостояниеИнтеграцииСПлатформойСамозанятые(Организация, Ответ) Экспорт
	
	Если Ответ.Результат = Неопределено
		ИЛИ ТипЗнч(Ответ.Результат) <> Тип("Структура") Тогда
		// Возникла исключительная ошибка обработки запроса - текущее состояние не изменяем.
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтатусыЗапросов = ИнтеграцияСПлатформойСамозанятыеКлиентСервер.СтатусыЗапросов();
	
	ИдентификаторЗаявки = "";
	СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.ПустаяСсылка();
	
	Если Ответ.Результат.Свойство("ДатаОтвязки") Тогда
		// Приложение отвязано
		ДатаОтвязки = НачалоДня(Ответ.Результат.ДатаОтвязки);
		Если ЗначениеЗаполнено(ДатаОтвязки) Тогда
			СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.Отключено;
		КонецЕсли;
	КонецЕсли;
		
	Если Ответ.Результат.Свойство("Идентификатор") Тогда
		// Заявка отправлена
		СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.НеПривязано;
		ИдентификаторЗаявки = Ответ.Результат.Идентификатор;
	Иначе
		ИдентификаторЗаявки = ПолучитьИдентификаторЗаявки(Организация);
	КонецЕсли;

	Если Ответ.Результат.Свойство("ДатаРассмотренияЗаявки") Тогда
		// Заявка отправлена но не подтверждена
		ДатаРассмотренияЗаявки = НачалоДня(Ответ.Результат.ДатаРассмотренияЗаявки);
		Если НЕ ЗначениеЗаполнено(ДатаРассмотренияЗаявки) Тогда
			СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.НеПривязано;
		Иначе
			ИдентификаторЗаявки = "";
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СостояниеИнтеграции) И Ответ.Результат.Свойство("Разрешения") Тогда
		// Запрос списка разрешений
		Если Ответ.Результат.Разрешения.ОтражениеДохода
			И Ответ.Результат.Разрешения.ПолучениеCводнойИнформацииОДоходе
			И Ответ.Результат.Разрешения.ПолучениеИнформацииПоДоходам
			И Ответ.Результат.Разрешения.ПолучениеинформацииПоНалоговымНачислениям
			И (Ответ.Результат.Разрешения.КорректировкаСведенийОДоходахПоданныхПартнером
			ИЛИ Ответ.Результат.Разрешения.КорректировкаСведенийОДоходахБезОграничений) Тогда
			// Выданы все разрешения
			
			СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.Подключено;
			
		Иначе
			// Выданы НЕ все разрешения
			СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.НеНастроено;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущееСостояниеПодключения = ПолучитьСостояниеПодключения(Организация);
	
	Если НЕ ЗначениеЗаполнено(СостояниеИнтеграции) И Ответ.Статус = СтатусыЗапросов.Ошибка Тогда
		
		Если ТекущееСостояниеПодключения <> Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.Отключено Тогда
			Если Ответ.Результат.Свойство("Код") Тогда
				Если Ответ.Результат.Код = "НедостаточноПолномочий" Тогда
					// Не подтвержден партнер.
					СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.Отсутствует;
					
				ИначеЕсли Ответ.Результат.Код = "ОшибкаПарсингаЗапроса" Тогда
					// Не ставился на учет.
					СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.Отсутствует;
					
				ИначеЕсли Ответ.Результат.Код = "НалогоплательщикНеЗарегистрирован" Тогда
					// Снят с учета.
					СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.Отключено;
					
				ИначеЕсли Ответ.Результат.Код = "НалогоплательщикНеПривязан" Тогда
					// Не привязан.
					Если ПустаяСтрока(ИдентификаторЗаявки) Тогда
						СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.Отсутствует;
					Иначе
						СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.НеПривязано;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СостояниеИнтеграции) Тогда
			Если Ответ.Результат.Код = "НалогоплательщикУжеПривязан" Тогда
				// Уже привязан, но мы не знаем списка разрешений.
				СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.НеНастроено;
			ИначеЕсли Ответ.Результат.Код = "НалогоплательщикНеПривязан" Тогда
				// Не привязан.
				Если ПустаяСтрока(ИдентификаторЗаявки) Тогда
					СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.Отсутствует;
				Иначе
					СостояниеИнтеграции = Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.НеПривязано;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СостояниеИнтеграции) Тогда
		СостояниеИнтеграции = ТекущееСостояниеПодключения;
	КонецЕсли;
	
	Если Ответ.Результат.Свойство("ИдентификаторПриложения") Тогда
		ИдентификаторПриложения = Ответ.Результат.ИдентификаторПриложения;
	Иначе
		ИдентификаторПриложения = ИдентификаторПриложения(Организация);
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.СостоянияИнтеграцииСПлатформойСамозанятые.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация             = Организация;
	МенеджерЗаписи.ДатаВремяСобытия        = ТекущаяДатаСеанса();
	МенеджерЗаписи.Состояние               = СостояниеИнтеграции;
	МенеджерЗаписи.ИдентификаторПриложения = ИдентификаторПриложения;
	МенеджерЗаписи.ИдентификаторЗаявки     = ИдентификаторЗаявки;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Возвращает идентификатор заявки на подключение.
// Параметры:
//   Организация - СправочникСсылка.Организации.
// Возвращаемое значение:
//     Строка - значение идентификатора.
//
Функция ПолучитьИдентификаторЗаявки(Организация) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СостоянияИнтеграцииСПлатформойСамозанятые.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат МенеджерЗаписи.ИдентификаторЗаявки;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Возвращает строковое представление состояния подключения.
// Параметры:
//   Организация - СправочникСсылка.Организации.
// Возвращаемое значение:
//     Строка - значение состояния.
//
Функция ПолучитьСостояниеПодключения(Организация) Экспорт
	
	СостояниеПодключения = Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.Отсутствует;
	
	МенеджерЗаписи = РегистрыСведений.СостоянияИнтеграцииСПлатформойСамозанятые.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Если ЗначениеЗаполнено(МенеджерЗаписи.Состояние) Тогда
			Состояниеподключения = МенеджерЗаписи.Состояние;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СостояниеПодключения;
	
КонецФункции

// Возвращает информацию об использовании сервиса и состоянии настройки.
// Параметры:
//   Организация - СправочникСсылка.Организации.
// Возвращаемое значение:
//     Структура - см. НовоеСобытие.
//
Функция ИнформацияОСобытияхПлатформыСамозанятые(Организация) Экспорт
	
	Результат = Неопределено;
	
	Если НЕ УчетнаяПолитика.ПрименяетсяНалогНаПрофессиональныйДоход(Организация, ТекущаяДатаСеанса()) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПолучитьНовыеСобытияИзСервиса(Организация);
	
	Возврат РезультатЗапросаТекущееСостояние(Организация);
	
КонецФункции

// Возвращает идентификатор, присвоенный организации в сервисе "Чеки самозанятых".
//
// Параметры:
//   Организация - СправочникСсылка.Организации - организация, подключенная к сервису.
//
// Возвращаемое значение:
//   Строка - Идентификатор приложения в сервисе Чеки самозанятых для указанной организации.
//
Функция ИдентификаторПриложения(Организация) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СостоянияИнтеграцииСПлатформойСамозанятые.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат МенеджерЗаписи.ИдентификаторПриложения;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область РаботаСБаннером

Функция НовоеСобытие()

	Результат = Новый Структура;
	Результат.Вставить("Организация",         Справочники.Организации.ПустаяСсылка());
	Результат.Вставить("Состояние",           Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.Отсутствует);
	Результат.Вставить("ДатаВремяСобытия",    ТекущаяДатаСеанса());
	
	Возврат Результат;
	
КонецФункции

Функция ДатаВремяПоследнегоСобытия(Организация)
	
	ДатаВремяСобытия = Дата("00010101");
	
	МенеджерЗаписи = РегистрыСведений.СостоянияИнтеграцииСПлатформойСамозанятые.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Если ЗначениеЗаполнено(МенеджерЗаписи.Состояние) Тогда
			ДатаВремяСобытия = МенеджерЗаписи.ДатаВремяСобытия;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДатаВремяСобытия;
	
КонецФункции

Процедура ПолучитьНовыеСобытияИзСервиса(Организация)
	
	Если НЕ УчетнаяПолитика.ПрименяетсяНалогНаПрофессиональныйДоход(Организация, ТекущаяДатаСеанса()) Тогда
		Возврат;
	КонецЕсли;
	
	// Чтобы не частить.
	ДатаВремяСобытия = ДатаВремяПоследнегоСобытия(Организация);
	Если ТекущаяДатаСеанса() - ДатаВремяСобытия <= 5 Тогда
		Возврат;
	КонецЕсли;
	
	СтатусыЗапросов = ИнтеграцияСПлатформойСамозанятыеКлиентСервер.СтатусыЗапросов();
	
	ПараметрыВзаимодействия = 
		ИнтеграцияСПлатформойСамозанятыеКлиентСервер.НовыеПараметрыМетодаВзаимодействия("СписокРазрешений");
	ПараметрыВзаимодействия.Организация = Организация;
	ОтветСервиса = ИнтеграцияСПлатформойСамозанятые.ВыполнитьМетодВзаимодействия(ПараметрыВзаимодействия);
	
	Если ОтветСервиса.Ошибка Тогда
		Возврат;
	КонецЕсли;
	
	Для Повтор = 1 По 15 Цикл
		ОтветРезультат = ИнтеграцияСПлатформойСамозанятые.ПолучитьРезультатВыполнения(ОтветСервиса);
		Если ОтветРезультат.Статус = СтатусыЗапросов.Выполняется Тогда
			ОбщегоНазначенияБТС.Пауза(Повтор);
		Иначе
			ЗаписатьСостояниеИнтеграцииСПлатформойСамозанятые(Организация, ОтветРезультат);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция РезультатЗапросаТекущееСостояние(Организация)
	
	ТекущееСостояние = Неопределено;
	
	Если НЕ УчетнаяПолитика.ПрименяетсяНалогНаПрофессиональныйДоход(Организация, ТекущаяДатаСеанса()) Тогда
		Возврат ТекущееСостояние;
	КонецЕсли;
	
	СостояниеПодключения = ПолучитьСостояниеПодключения(Организация);
	Если СостояниеПодключения = Перечисления.СостоянияИнтеграцииСПлатформойСамозанятые.Подключено Тогда
		Возврат ТекущееСостояние;
	КонецЕсли;
	
	ТекущееСостояние = НовоеСобытие();
	ТекущееСостояние.Организация = Организация;
	ТекущееСостояние.Состояние   = СостояниеПодключения;
	
	Возврат ТекущееСостояние;
	
КонецФункции

#КонецОбласти

#КонецЕсли
